package com.follow.user.enums;

import com.follow.common.result.BaseErrorCode;

public enum UserErrorEnum implements BaseErrorCode {

    未登录(1001,"您当前未登录"),
    在别处登录(1002,"该账号已在别处登录，请重新登录"),
    登录超时(1003,"登录超时，请重新登录"),
    请进行令牌刷新(1004,"请进行令牌刷新"),
    请输入验证码(1005,"请输入验证码"),
    验证码不正确(1006,"验证码不正确"),
    该手机号码未注册(1007,"该手机号码未注册"),
    该用户已被禁用(1008,"该用户已被禁用，请联系客服"),
    密码不正确(1009,"密码不正确"),
    手机号码格式不正确(1010,"手机号码格式不正确"),
    该手机号码已注册(1011,"该手机号码已注册"),
    签名错误(1012,"签名错误"),
    签名数据不正确(1013,"签名数据不正确"),
    appid不允许为空(1014,"appid不允许为空"),
    timestamp不允许为空(1015,"timestamp不允许为空"),
    nonce不允许为空(1016,"nonce不允许为空"),
    该请求已超时(1017,"该请求已超时"),
    appid无效(1018,"appid无效"),
    IP不在白名单内(1019,"IP不在白名单内"),
    sign不允许为空(1020,"sign不允许为空"),
    手机号码不正确(1021,"手机号码不正确"),
    商家名称已存在(1022,"商家名称已存在"),
    该订单不存在(1023,"该订单不存在"),
    只有一辆车不允许删除默认车(1024,"只有一辆车不允许删除默认车"),
    文件不存在(1025,"文件不存在"),
    请选择要上传的文件(1026,"请选择要上传的文件"),
    发送短信频繁请稍后再试(1027,"发送短信频繁，请稍后再试"),
    ip频繁(1028,"发送短信验证码频繁，请明天再试"),
    手机号码频繁(1029,"发送短信验证码频繁，请明天再试"),
    车牌号码不正确(1030,"车牌号码不正确"),
    正在停车(1031,"该车辆正在停车，请结束停车再解除绑定"),
    账号注册失败(1032,"账号注册失败"),
    请使用验证码登录(1032,"该账号未设置密码，请使用验证码登录"),
    非微信公众号登录(1034,"该账号非微信公众号登录"),
    请求参数错误(1035,"请求参数错误"),
    优惠券库存不足(1036,"优惠券库存不足"),
    领取已达上限(1037,"领取已达上限"),
    优惠券库存数量异常(1038,"优惠券库存数量异常"),
    未绑定手机(1039,"未绑定手机，无法领取优惠券"),
    权限不足(1040,"权限不足"),
    采集失败(1041,"采集失败，请联系后台人员"),
    ;


    private int key;
    private String value;

    UserErrorEnum(Integer key, String value) {
        this.key = key;
        this.value = value;
    }

    @Override
    public int getKey() {
        return this.key;
    }

    @Override
    public String getValue() {
        return this.value;
    }

    @Override
    public Object getObject() {
        return this;
    }
}
